Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/atdf/ATSAML11D14A.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2019 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2020-02-04T13:16:20Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="ATSAML11D14A-MU" mhc:ordercode="ATSAML11D14A-MU" package="QFN24" pinout="SAML1xD" speedmax="32000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="ATSAML11D14A-MF" mhc:ordercode="ATSAML11D14A-MF" package="QFN24" pinout="SAML1xD" speedmax="32000000" tempmin="-40" tempmax="125" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="ATSAML11D14A-YU" mhc:ordercode="ATSAML11D14A-YU" package="SSOP24" pinout="SAML1xDY" speedmax="32000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="ATSAML11D14A-YF" mhc:ordercode="ATSAML11D14A-YF" package="SSOP24" pinout="SAML1xDY" speedmax="32000000" tempmin="-40" tempmax="125" vccmin="1.62" vccmax="3.63"/>
  </variants>
  <devices>
    <device name="ATSAML11D14A" architecture="CORTEX-M23" family="SAML" series="SAML11">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x4000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="AUX" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="BOCOR" start="0x0080C000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="DATAFLASH" start="0x00400000" size="0x800" type="flash" pagesize="64" rw="RW"/>
          <memory-segment name="SW_CALIB" start="0x00806020" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="TEMP_LOG" start="0x00806038" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x2000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="APBA" start="0x40000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="APBB" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="APBC" start="0x42000000" size="0x4000" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x20000000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="NUM_IRQ" value="45" caption="Number of interrupt request lines"/>
        <param name="__ARMv8MBL_REV" value="0x0000" caption="Cortex-M23 Core Revision"/>
        <param name="__BKPT_NUM" value="4" caption="Number of FPB breakpoint comparators"/>
        <param name="__ETM_PRESENT" value="0" caption="ETM present or not"/>
        <param name="__FPU_PRESENT" value="0" caption="FPU present or not"/>
        <param name="__MPU_NS_REGIONS" value="4" caption="Number of MPU_NS regions"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__MPU_S_REGIONS" value="4" caption="Number of MPU_S regions"/>
        <param name="__MTB_PRESENT" value="0" caption="MTB present or not"/>
        <param name="__NVIC_PRIO_BITS" value="2" caption="Number of Bits used for Priority Levels"/>
        <param name="__SAU_PRESENT" value="0" caption="SAU present or not"/>
        <param name="__SEC_ENABLED" value="1" caption="TrustZone-M enabled or not"/>
        <param name="__SYST_NUM" value="2" caption="Number of SysTick instances"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__WPT_NUM" value="2" caption="Number of DWT watchpoint comparators"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.0.2">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x40003400"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA04"/>
              <signal group="AIN" index="1" function="B" pad="PA05"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="17" caption="Index of Generic Clock"/>
              <param name="NUM_CMP" value="2" caption="Number of comparators"/>
              <param name="PAIRS" value="1" caption="Number of pairs of comparators"/>
              <param name="INSTANCE_ID" value="13"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2247" version="2.4.0">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA02"/>
              <signal group="AIN" index="1" function="B" pad="PA03"/>
              <signal group="AIN" index="2" function="B" pad="PA04"/>
              <signal group="AIN" index="3" function="B" pad="PA05"/>
              <signal group="AIN" index="6" function="B" pad="PA08"/>
              <signal group="VREFP" function="B" pad="PA04"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="19" caption="index of DMA RESRDY trigger"/>
              <param name="EXTCHANNEL_MSB" value="9" caption="Number of external channels"/>
              <param name="GCLK_ID" value="16" caption="index of Generic Clock"/>
              <param name="INT_CH30" value="1" caption="Select OPAMP or CTAT on Channel 30"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="ADC Master/Slave Mode"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="2.0.0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="20" caption="GCLK index for CCL"/>
              <param name="LUT_NUM" value="2" caption="Number of LUT in a CCL"/>
              <param name="SEQ_NUM" value="1" caption="Number of SEQ in a CCL"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="DAC" id="U2214" version="2.1.0">
          <instance name="DAC">
            <register-group name="DAC" name-in-module="DAC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="VOUT" function="B" pad="PA02"/>
              <signal group="VREFP" function="B" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EMPTY" value="20" caption="Index of DMA EMPTY trigger"/>
              <param name="GCLK_ID" value="18"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
        </module>
        <module name="DMAC" id="U2223" version="2.4.0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="CH_BITS" value="3" caption="Number of bits to select channel"/>
              <param name="CH_NUM" value="8" caption="Number of channels"/>
              <param name="EVIN_NUM" value="4" caption="Number of input events"/>
              <param name="EVOUT_NUM" value="4" caption="Number of output events"/>
              <param name="LVL_BITS" value="2" caption="Number of bit to select level priority"/>
              <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="QOS dmac ahb interface reset value"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="QOS dmac fetch interface reset value"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="QOS dmac write back interface reset value"/>
              <param name="TRIG_BITS" value="5" caption="Number of bits to select trigger source"/>
              <param name="TRIG_NUM" value="24" caption="Number of peripheral triggers"/>
              <param name="CHANNEL0_INT_SRC" value="11" caption="DMA Channel 0 Interrupt"/>
              <param name="CHANNEL1_INT_SRC" value="12" caption="DMA Channel 1 Interrupt"/>
              <param name="CHANNEL2_INT_SRC" value="13" caption="DMA Channel 2 Interrupt"/>
              <param name="CHANNEL3_INT_SRC" value="14" caption="DMA Channel 3 Interrupt"/>
              <param name="CHANNEL4_INT_SRC" value="15" caption="DMA Channel 4 Interrupt"/>
              <param name="CHANNEL5_INT_SRC" value="15" caption="DMA Channel 5 Interrupt"/>
              <param name="CHANNEL6_INT_SRC" value="15" caption="DMA Channel 6 Interrupt"/>
              <param name="CHANNEL7_INT_SRC" value="15" caption="DMA Channel 7 Interrupt"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2810" version="1.0.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <register-group name="DSU_EXT" name-in-module="DSU" address-space="base" offset="0x41002100" size="0x100"/>
            <parameters>
              <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
              <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2804" version="1.0.0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <register-group name="EIC_SEC" name-in-module="EIC" address-space="base" offset="0x40002A00"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA19"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA22"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA23"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA14"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA15"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA16"/>
              <signal group="EXTINT" index="6" function="A" pad="PA17"/>
              <signal group="EXTINT" index="6" function="A" pad="PA30"/>
              <signal group="EXTINT" index="7" function="A" pad="PA18"/>
              <signal group="EXTINT" index="7" function="A" pad="PA31"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="8" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="3" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="1" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_DPRESCALER_REGS" value="1" caption="Number of DPRESCALER registers"/>
              <param name="NUMBER_OF_INTERRUPTS" value="8" caption="Number of external interrupts (obsolete)"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
        </module>
