Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/atdf/ATSAML11D14A.atdf
        <module name="SUPC" id="U2117" version="4.0.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <parameters>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="HAS_STDBYPL0_BIT" value="1" caption="STDBYPL0 bit is present"/>
              <param name="HAS_LPEFF_BIT" value="1" caption="LPEFF bit is present"/>
              <param name="HAS_SEL_BIT" value="1" caption="SEL bit is present"/>
              <param name="HAS_BOD33_REG_NAME" value="1" caption="Name of BOD register is BOD33"/>
              <param name="HAS_VREFSEL_BIT" value="1" caption="VREFSEL bit is present"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="3.1.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="10" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="14" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="13" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="14" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="16" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="15" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
        </module>
        <module name="TRAM" id="U2801" version="1.0.0">
          <instance name="TRAM">
            <register-group name="TRAM" name-in-module="TRAM" address-space="base" offset="0x42003400"/>
            <parameters>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="U2242" version="1.2.0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42002800"/>
            <parameters>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="2.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
          </instance>
          <instance name="CoreDebug_NS">
            <register-group name="CoreDebug_NS" name-in-module="CoreDebug" address-space="base" offset="0xE002EDF0"/>
          </instance>
        </module>
        <module name="DIB" version="1.0.0">
          <instance name="DIB">
            <register-group name="DIB" name-in-module="DIB" address-space="base" offset="0xE000EFB0"/>
          </instance>
          <instance name="DIB_NS">
            <register-group name="DIB_NS" name-in-module="DIB" address-space="base" offset="0xE002EFB0"/>
          </instance>
        </module>
        <module name="DWT" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
            <parameters>
              <param name="__WPT_NUM" value="2" caption="Number of DWT watchpoint comparators"/>
            </parameters>
          </instance>
        </module>
