Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/atdf/ATSAML11D14A.atdf
        <register name="BOCOR_WORD_24" offset="0x60" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 24">
          <bitfield name="BOOTROM_BOOTKEY_4" caption="Secure Boot Key bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_25" offset="0x64" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 25">
          <bitfield name="BOOTROM_BOOTKEY_5" caption="Secure Boot Key bits 191:160" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_26" offset="0x68" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 26">
          <bitfield name="BOOTROM_BOOTKEY_6" caption="Secure Boot Key bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_27" offset="0x6C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 27">
          <bitfield name="BOOTROM_BOOTKEY_7" caption="Secure Boot Key bits 255:224" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_56" offset="0xE0" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 56">
          <bitfield name="BOOTROM_BOCORHASH_0" caption="Boot Configuration Row Hash bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_57" offset="0xE4" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 57">
          <bitfield name="BOOTROM_BOCORHASH_1" caption="Boot Configuration Row Hash bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_58" offset="0xE8" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 58">
          <bitfield name="BOOTROM_BOCORHASH_2" caption="Boot Configuration Row Hash bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_59" offset="0xEC" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 59">
          <bitfield name="BOOTROM_BOCORHASH_3" caption="Boot Configuration Row Hash bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_60" offset="0xF0" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 60">
          <bitfield name="BOOTROM_BOCORHASH_4" caption="Boot Configuration Row Hash bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_61" offset="0xF4" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 61">
          <bitfield name="BOOTROM_BOCORHASH_5" caption="Boot Configuration Row Hash bits 191:160" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_62" offset="0xF8" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 62">
          <bitfield name="BOOTROM_BOCORHASH_6" caption="Boot Configuration Row Hash bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_63" offset="0xFC" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 63">
          <bitfield name="BOOTROM_BOCORHASH_7" caption="Boot Configuration Row Hash bits 255:224" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="SW_CALIB_FUSES">
        <register name="SW_CALIB_WORD_0" offset="0x0" rw="R" size="4" caption="SW_CALIB Page Word 0">
          <bitfield name="ADC_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="DFLLULP_DIV_PL0" caption="DFLLULP DIV at PL0" mask="0x1C0"/>
          <bitfield name="DFLLULP_DIV_PL2" caption="DFLLULP DIV at PL2" mask="0xE00"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" rw="R" size="4" caption="TEMP_LOG Page Word 0">
          <bitfield name="ROOM_TEMP_VAL_INT" caption="Integer part of room temperature in oC" mask="0xFF"/>
          <bitfield name="ROOM_TEMP_VAL_DEC" caption="Decimal part of room temperature" mask="0xF00"/>
          <bitfield name="HOT_TEMP_VAL_INT" caption="Integer part of hot temperature in oC" mask="0xFF000"/>
          <bitfield name="HOT_TEMP_VAL_DEC" caption="Decimal part of hot temperature" mask="0xF00000"/>
          <bitfield name="ROOM_INT1V_VAL" caption="2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)" mask="0xFF000000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" rw="R" size="4" caption="TEMP_LOG Page Word 1">
          <bitfield name="HOT_INT1V_VAL" caption="2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)" mask="0xFF"/>
          <bitfield name="ROOM_ADC_VAL_PTAT" caption="12-bit ADC conversion at room temperature PTAT" mask="0xFFF00"/>
          <bitfield name="HOT_ADC_VAL_PTAT" caption="12-bit ADC conversion at hot temperature PTAT" mask="0xFFF00000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" rw="RW" size="4" initval="0xB1FF437F" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_NSULCK" caption="NVM Non-Secure Region Locks" mask="0x38"/>
          <bitfield name="BOD33_LEVEL" caption="BOD33 threshold Level" mask="0x1F80"/>
          <bitfield name="BOD33_DIS" caption="BOD33 Disable" mask="0x2000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0xC000" values="SUPC_BOD33__ACTION"/>
          <bitfield name="WDT_RUNSTDBY" caption="WDT Run During Standby" mask="0x2000000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000" values="WDT_CONFIG__PER"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFFFFCBB" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF" values="WDT_CONFIG__WINDOW"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0" values="WDT_EWCTRL__EWOFFSET"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x200"/>
        </register>
        <register name="USER_WORD_2" offset="0x8" rw="RW" size="4" initval="0xFFF8C0FF" caption="USER Page Word 2">
          <bitfield name="IDAU_AS" caption="Application Secure" mask="0xFF"/>
          <bitfield name="IDAU_ANSC" caption="Application Non-Secure Callable" mask="0x3F00"/>
          <bitfield name="IDAU_DS" caption="Data Secure" mask="0xF0000"/>
          <bitfield name="IDAU_RS" caption="RAM Secure" mask="0x7F000000"/>
        </register>
        <register name="USER_WORD_3" offset="0xC" rw="RW" size="4" initval="0xFFFFFFFF" caption="USER Page Word 3">
          <bitfield name="NVMCTRL_URWEN" caption="User Row Write Enable" mask="0x1"/>
        </register>
