Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/atdf/ATSAML11D14A.atdf
        <register name="DPLLPRESC" offset="0x38" rw="RW" access="WSYNC" size="1" initval="0x00" caption="DPLL Prescaler">
          <bitfield name="PRESC" caption="Output Clock Prescaler" mask="0x3" values="OSCCTRL_DPLLPRESC__PRESC"/>
        </register>
        <register name="DPLLSYNCBUSY" offset="0x3C" rw="R" size="1" initval="0x00" caption="DPLL Synchronization Busy">
          <bitfield name="ENABLE" caption="DPLL Enable Synchronization Status" mask="0x2"/>
          <bitfield name="DPLLRATIO" caption="DPLL Loop Divider Ratio Synchronization Status" mask="0x4"/>
          <bitfield name="DPLLPRESC" caption="DPLL Prescaler Synchronization Status" mask="0x8"/>
        </register>
        <register name="DPLLSTATUS" offset="0x40" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock" mask="0x1"/>
          <bitfield name="CLKRDY" caption="DPLL Clock Ready" mask="0x2"/>
        </register>
      </register-group>
      <value-group name="OSCCTRL_OSC16MCTRL__FSEL">
        <value name="4" caption="4MHz" value="0x0"/>
        <value name="8" caption="8MHz" value="0x1"/>
        <value name="12" caption="12MHz" value="0x2"/>
        <value name="16" caption="16MHz" value="0x3"/>
      </value-group>
      <value-group name="OSCCTRL_XOSCCTRL__STARTUP">
        <value name="CYCLE1" caption="31 us" value="0"/>
        <value name="CYCLE2" caption="61 us" value="1"/>
        <value name="CYCLE4" caption="122 us" value="2"/>
        <value name="CYCLE8" caption="244 us" value="3"/>
        <value name="CYCLE16" caption="488 us" value="4"/>
        <value name="CYCLE32" caption="977 us" value="5"/>
        <value name="CYCLE64" caption="1953 us" value="6"/>
        <value name="CYCLE128" caption="3906 us" value="7"/>
        <value name="CYCLE256" caption="7813 us" value="8"/>
        <value name="CYCLE512" caption="15625 us" value="9"/>
        <value name="CYCLE1024" caption="31250 us" value="10"/>
        <value name="CYCLE2048" caption="62500 us" value="11"/>
        <value name="CYCLE4096" caption="125000 us" value="12"/>
        <value name="CYCLE8192" caption="250000 us" value="13"/>
        <value name="CYCLE16384" caption="500000 us" value="14"/>
        <value name="CYCLE32768" caption="1000000 us" value="15"/>
      </value-group>
      <value-group name="OSCCTRL_XOSCCTRL__GAIN">
        <value name="GAIN2" caption="2 MHz" value="0"/>
        <value name="GAIN4" caption="4 MHz" value="1"/>
        <value name="GAIN8" caption="8 MHz" value="2"/>
        <value name="GAIN16" caption="16 MHz" value="3"/>
        <value name="GAIN30" caption="30 MHz" value="4"/>
      </value-group>
      <value-group name="OSCCTRL_CFDPRESC__CFDPRESC">
        <value name="DIV1" caption="OSC16M/1" value="0"/>
        <value name="DIV2" caption="OSC16M/2" value="1"/>
        <value name="DIV4" caption="OSC16M/4" value="2"/>
        <value name="DIV8" caption="OSC16M/8" value="3"/>
        <value name="DIV16" caption="OSC16M/16" value="4"/>
        <value name="DIV32" caption="OSC16M/32" value="5"/>
        <value name="DIV64" caption="OSC16M/64" value="6"/>
        <value name="DIV128" caption="OSC16M/128" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DFLLULPCTRL__DIV">
        <value name="DIV1" caption="Frequency Divided by 1" value="0x0"/>
        <value name="DIV2" caption="Frequency Divided by 2" value="0x1"/>
        <value name="DIV4" caption="Frequency Divided by 4" value="0x2"/>
        <value name="DIV8" caption="Frequency Divided by 8" value="0x3"/>
        <value name="DIV16" caption="Frequency Divided by 16" value="0x4"/>
        <value name="DIV32" caption="Frequency Divided by 32" value="0x5"/>
      </value-group>
      <value-group name="OSCCTRL_DFLLULPDITHER__PER">
        <value name="PER1" caption="Dither Over 1 Reference Clock Period" value="0x0"/>
        <value name="PER2" caption="Dither Over 2 Reference Clock Period" value="0x1"/>
        <value name="PER4" caption="Dither Over 4 Reference Clock Period" value="0x2"/>
        <value name="PER8" caption="Dither Over 8 Reference Clock Period" value="0x3"/>
        <value name="PER16" caption="Dither Over 16 Reference Clock Period" value="0x4"/>
        <value name="PER32" caption="Dither Over 32 Reference Clock Period" value="0x5"/>
      </value-group>
      <value-group name="OSCCTRL_DFLLULPDITHER__STEP">
        <value name="STEP1" caption="Dither Step = 1" value="0x0"/>
        <value name="STEP2" caption="Dither Step = 2" value="0x1"/>
        <value name="STEP4" caption="Dither Step = 4" value="0x2"/>
        <value name="STEP8" caption="Dither Step = 8" value="0x3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__FILTER">
        <value name="Default" caption="Default Filter Mode" value="0"/>
        <value name="LBFILT" caption="Low Bandwidth Filter" value="1"/>
        <value name="HBFILT" caption="High Bandwidth Filter" value="2"/>
        <value name="HDFILT" caption="High Damping Filter" value="3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
        <value name="Default" caption="No time-out. Automatic lock" value="0"/>
        <value name="8MS" caption="Time-out if no lock within 8 ms" value="4"/>
        <value name="9MS" caption="Time-out if no lock within 9 ms" value="5"/>
        <value name="10MS" caption="Time-out if no lock within 10 ms" value="6"/>
        <value name="11MS" caption="Time-out if no lock within 11 ms" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
        <value name="XOSC32K" caption="XOSC32K Clock Reference" value="0"/>
        <value name="XOSC" caption="XOSC Clock Reference" value="1"/>
        <value name="GCLK" caption="GCLK Clock Reference" value="2"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLPRESC__PRESC">
        <value name="DIV1" caption="DPLL output is divided by 1" value="0"/>
        <value name="DIV2" caption="DPLL output is divided by 2" value="1"/>
        <value name="DIV4" caption="DPLL output is divided by 4" value="2"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="4.0.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
