Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/atdf/ATSAML11D14A.atdf
      <value-group name="WDT_CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
    <module name="CoreDebug" version="1.0.0" caption="Debug Control Block">
      <register-group name="CoreDebug" caption="Debug Control Block">
        <register name="DHCSR" offset="0x0" rw="RW" size="4" access-size="4" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" caption="Enable Halting debug" mask="0x1"/>
          <bitfield name="C_HALT" caption="Halt processor" mask="0x2"/>
          <bitfield name="C_STEP" caption="Enable single step" mask="0x4"/>
          <bitfield name="C_MASKINTS" caption="Mask PendSV, SysTick and external configurable interrupts" mask="0x8"/>
          <bitfield name="S_SNAPSTALL" caption="Snap stall control" mask="0x20"/>
          <bitfield name="S_REGRDY" caption="Register ready status" mask="0x10000"/>
          <bitfield name="S_HALT" caption="Halted status" mask="0x20000"/>
          <bitfield name="S_SLEEP" caption="Sleeping status" mask="0x40000"/>
          <bitfield name="S_LOCKUP" caption="Lockup status" mask="0x80000"/>
          <bitfield name="S_SDE" caption="Secure debug enabled" mask="0x100000"/>
          <bitfield name="S_RETIRE_ST" caption="Retire sticky status" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" caption="Reset sticky status" mask="0x2000000"/>
          <bitfield name="S_RESTART_ST" caption="Restart sticky status" mask="0x4000000"/>
        </register>
        <register name="DCRSR" offset="0x4" rw="W" size="4" access-size="4" caption="Debug Core Register Select Register">
          <bitfield name="REGSEL" caption="Register selector" mask="0x7F"/>
          <bitfield name="REGWnR" caption="Register write/not-read access" mask="0x10000"/>
        </register>
        <register name="DEMCR" offset="0xC" rw="RW" size="4" access-size="4" caption="Debug Exception and Monitor Control Register">
          <bitfield name="VC_CORERESET" caption="Core reset Halting debug vector catch enable" mask="0x1"/>
          <bitfield name="VC_MMERR" caption="MemManage exception Halting debug vector catch enable" mask="0x10"/>
          <bitfield name="VC_NOCPERR" caption="UsageFault exception coprocessor access Halting debug vector catch enable" mask="0x20"/>
          <bitfield name="VC_CHKERR" caption="UsageFault exception checking error Halting debug vector catch enable" mask="0x40"/>
          <bitfield name="VC_STATERR" caption="UsageFault exception state information error Halting debug vector catch enable" mask="0x80"/>
          <bitfield name="VC_BUSERR" caption="BusFault exception Halting debug vector catch enable" mask="0x100"/>
          <bitfield name="VC_INTERR" caption="Excception entry and return faults Halting debug vector catch enable" mask="0x200"/>
          <bitfield name="VC_HARDERR" caption="HardFault exception Halting debug vector catch enable" mask="0x400"/>
          <bitfield name="VC_SFERR" caption="SecureFault exception Halting debug vector catch enable" mask="0x800"/>
          <bitfield name="MON_EN" caption="DebugMonitor enable" mask="0x10000"/>
          <bitfield name="MON_PEND" caption="DebugMonitor pending state" mask="0x20000"/>
          <bitfield name="MON_STEP" caption="Enable DebugMonitor stepping" mask="0x40000"/>
          <bitfield name="MON_REQ" caption="DebugMonitor semaphore bit" mask="0x80000"/>
          <bitfield name="SDME" caption="Secure DebugMonitor enable" mask="0x100000"/>
          <bitfield name="TRCENA" caption="Global DWT and ITM features enable" mask="0x1000000"/>
        </register>
        <register name="DAUTHCTRL" offset="0x14" rw="RW" size="4" access-size="4" caption="Debug Authentication Control Register">
          <bitfield name="SPIDENSEL" caption="Secure invasive debug enable select" mask="0x1"/>
          <bitfield name="INTSPIDEN" caption="Internal Secure invasive debug enable" mask="0x2"/>
          <bitfield name="SPNIDENSEL" caption="Secure non-invasive debug enable select" mask="0x4"/>
          <bitfield name="INTSPNIDEN" caption="Internal Secure non-invasive debug enable" mask="0x8"/>
        </register>
        <register name="DSCSR" offset="0x18" rw="RW" size="4" access-size="4" caption="Debug Security Control and Status Register">
          <bitfield name="SBRSELEN" caption="Secure Banked register select enable" mask="0x1"/>
          <bitfield name="SBRSEL" caption="Secure Banked register select" mask="0x2"/>
          <bitfield name="CDS" caption="Current domain Secure" mask="0x10000"/>
          <bitfield name="CDSKEY" caption="CDS field write-enable key" mask="0x20000"/>
        </register>
      </register-group>
    </module>
    <module name="DIB" version="1.0.0" caption="Debug Identification Block">
      <register-group name="DIB" caption="Debug Identification Block">
        <register name="DLAR" offset="0x0" rw="W" size="4" access-size="4" caption="SCS Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="DIB_DLAR__KEY"/>
        </register>
        <register name="DLSR" offset="0x4" rw="R" size="4" access-size="4" caption="SCS Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="DAUTHSTATUS" offset="0x8" rw="R" size="4" access-size="4" caption="Debug Authentication Status Register">
          <bitfield name="NSID" caption="" mask="0x1" values="DIB_DAUTHSTATUS__NSID"/>
          <bitfield name="NSNID" caption="" mask="0x4" values="DIB_DAUTHSTATUS__NSNID"/>
          <bitfield name="SID" caption="" mask="0x30" values="DIB_DAUTHSTATUS__SID"/>
          <bitfield name="SNID" caption="" mask="0xC0" values="DIB_DAUTHSTATUS__SNID"/>
        </register>
        <register name="DDEVARCH" offset="0xC" rw="R" size="4" access-size="4" initval="0x47702A04" caption="SCS Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
        <register name="DDEVTYPE" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
