Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/atdf/ATSAML11D14A.atdf
        <register name="DWT_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="DWT Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="DWT_LAR__KEY"/>
        </register>
        <register name="DWT_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="DWT Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="DWT_DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A02" caption="DWT Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
        <register name="DWT_DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="DWT_PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="DWT_PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 5">
        </register>
        <register name="DWT_PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 6">
        </register>
        <register name="DWT_PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 7">
        </register>
        <register name="DWT_PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="DWT_PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="DWT_PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="DWT_PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="DWT_CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="DWT Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="DWT_CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="DWT Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="DWT_CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="DWT Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="DWT_CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="DWT Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DWT_LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="FPB" version="1.0.0" caption="Flash Patch and Breakpoint">
      <register-group name="FPB" caption="Flash Patch and Breakpoint">
        <register name="FP_CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Flash Patch Control Register">
          <bitfield name="ENABLE" caption="Flash Patch global enable" mask="0x1"/>
          <bitfield name="KEY" caption="FP_CTRL write-enable key" mask="0x2"/>
          <bitfield name="NUM_CODE" caption="Number of implemented code comparators bits [3:0]" mask="0xF0"/>
          <bitfield name="NUM_LIT" caption="Number of literal comparators" mask="0xF00"/>
          <bitfield name="NUM_CODE_1" caption="Number of implemented code comparators bits [6:4]" mask="0x7000"/>
          <bitfield name="REV" caption="Revision" mask="0xF0000000"/>
        </register>
        <register name="FP_REMAP" offset="0x4" rw="R" size="4" access-size="4" caption="Flash Patch Remap Register">
          <bitfield name="REMAP" caption="Remap address" mask="0x1FFFFFE0"/>
          <bitfield name="RMPSPT" caption="Remap supported" mask="0x20000000"/>
        </register>
        <register name="FP_COMP" offset="0x8" rw="RW" size="4" access-size="4" count="4" caption="Flash Patch Comparator Register n">
          <mode name="BREAKPOINT"/>
          <mode name="DEFAULT"/>
          <bitfield name="BE" caption="Breakpoint enable" mask="0x1"/>
          <bitfield modes="DEFAULT" name="FPADDR" caption="Flash Patch address" mask="0x1FFFFFFC"/>
          <bitfield modes="DEFAULT" name="FE" caption="Flash Patch enable" mask="0x80000000"/>
          <bitfield modes="BREAKPOINT" name="BPADDR" caption="Breakpoint address" mask="0xFFFFFFFE"/>
        </register>
        <register name="FP_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="FPB Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="FPB_FP_LAR__KEY"/>
        </register>
        <register name="FP_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="FPB Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="FP_DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A03" caption="FPB Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
